app/controllers/school_classes_controller.rb

INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Test"], ["room_number", 43], ["created_at", "2020-10-29 17:37:26.508584"], ["updated_at", "2020-10-29 17:37:26.508584"]]
---
    def create
        school_class = SchoolClass.create(strong_params)

UPDATE "school_classes" SET "title" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "tasss-edited"], ["updated_at", "2020-10-29 17:52:00.209770"], ["id", 9]]
---
    def update
        @school_class.update(strong_params)

SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
    def find_schoolclass
        @school_class = SchoolClass.find(params[:id])