app/controllers/students_controller.rb

    def create
        strong_params = params.require(:student).permit(:first_name,:last_name)
        student = Student.create(strong_params)
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Yao "], ["last_name", "Minguh"], ["created_at", "2020-10-28 22:42:59.387703"], ["updated_at", "2020-10-28 22:42:59.387703"]]

    def update
        @student = Student.find(params[:id])
        strong_params = params.require(:student).permit(:first_name,:last_name)
        @student.update(strong_params)
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 12], ["LIMIT", 1]]
UPDATE "students" SET "first_name" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["first_name", "Yao teh"], ["updated_at", "2020-10-29 14:10:21.145819"], ["id", 12]]